In [1]:
import pandas as pd

In [2]:
data_18 = pd.read_csv("data_claning_2018.csv")
data_19 = pd.read_csv("startup_funding2019(Clean_Data).csv")
data_20 = pd.read_csv("data_2020.csv")
data_21 = pd.read_csv("IndiaClean_2021_data.csv")

In [3]:
data_18.isnull().sum()

Company/Brand    0
Stage            0
Amount($)        0
Location         0
What_it_does     0
Sector           0
dtype: int64

In [4]:
data_18 = pd.read_csv("data_claning_2018.csv")
data_18.head(2)

,Company/Brand,Stage,Amount($),Location,What_it_does,Sector
0,TheCollegeFever,Seed,250000.0,Bangalore,"TheCollegeFever is a hub for fun, fiesta and f...",Media & Entertainment
1,Happy Cow Dairy,Seed,1000000.0,Mumbai,A startup which aggregates milk from dairy far...,Agriculture

In [5]:
data_18.rename(columns={'Location':'HeadQuarter'},inplace=True)
data_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524 entries, 0 to 523
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  524 non-null    object
 1   Stage          524 non-null    object
 2   Amount($)      524 non-null    float64
 3   HeadQuarter    524 non-null    object
 4   What_it_does   524 non-null    object
 5   Sector         524 non-null    object
dtypes: float64(1), object(5)
memory usage: 24.7+ KB

In [6]:
data_19.isnull().sum()

Unnamed: 0       0
Company/Brand    0
Founded          0
HeadQuarter      0
Sector           0
What_it_does     0
Founders         0
Investor         0
Amount($)        0
Stage            0
dtype: int64

In [7]:
data_19 = data_19.drop('Unnamed: 0',axis = 1)

In [8]:
data_19.isnull().sum()

Company/Brand    0
Founded          0
HeadQuarter      0
Sector           0
What_it_does     0
Founders         0
Investor         0
Amount($)        0
Stage            0
dtype: int64

In [9]:
data_20.isnull().sum()

Company/Brand    0
Founded          0
HeadQuarter      0
Sector           0
What_it_does     0
Founders         0
Investor         0
Amount($)        0
Stage            0
dtype: int64

In [10]:
data_21.isnull().sum()

Company/Brand    0
Founded          0
HeadQuarter      0
Sector           0
What_it_does     0
Founders         0
Investor         0
Amount($)        0
Stage            0
dtype: int64

In [11]:
data_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 524 entries, 0 to 523
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  524 non-null    object
 1   Stage          524 non-null    object
 2   Amount($)      524 non-null    float64
 3   HeadQuarter    524 non-null    object
 4   What_it_does   524 non-null    object
 5   Sector         524 non-null    object
dtypes: float64(1), object(5)
memory usage: 24.7+ KB

In [12]:
data_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        89 non-null     float64
 2   HeadQuarter    89 non-null     object
 3   Sector         89 non-null     object
 4   What_it_does   89 non-null     object
 5   Founders       89 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     float64
 8   Stage          89 non-null     object
dtypes: float64(2), object(7)
memory usage: 6.4+ KB

In [13]:
data_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  1055 non-null   object
 1   Founded        1055 non-null   int64
 2   HeadQuarter    1055 non-null   object
 3   Sector         1055 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1055 non-null   object
 6   Investor       1055 non-null   object
 7   Amount($)      1055 non-null   float64
 8   Stage          1055 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 74.3+ KB

In [14]:
data_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  1055 non-null   object
 1   Founded        1055 non-null   int64
 2   HeadQuarter    1055 non-null   object
 3   Sector         1055 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1055 non-null   object
 6   Investor       1055 non-null   object
 7   Amount($)      1055 non-null   float64
 8   Stage          1055 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 74.3+ KB

In [15]:
data_21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1180 entries, 0 to 1179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  1180 non-null   object
 1   Founded        1180 non-null   int64
 2   HeadQuarter    1180 non-null   object
 3   Sector         1180 non-null   object
 4   What_it_does   1180 non-null   object
 5   Founders       1180 non-null   object
 6   Investor       1180 non-null   object
 7   Amount($)      1180 non-null   float64
 8   Stage          1180 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 83.1+ KB

In [16]:
# You can concatenate this with other DataFrames to get one data set for your work

df = pd.concat([data_18, data_19, data_20, data_21])
#df.to_csv('combined_data.csv')

In [17]:
df.to_csv('new_combined_data.csv')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2848 entries, 0 to 1179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  2848 non-null   object
 1   Stage          2848 non-null   object
 2   Amount($)      2848 non-null   float64
 3   HeadQuarter    2848 non-null   object
 4   What_it_does   2848 non-null   object
 5   Sector         2848 non-null   object
 6   Founded        2324 non-null   float64
 7   Founders       2324 non-null   object
 8   Investor       2324 non-null   object
dtypes: float64(2), object(7)
memory usage: 222.5+ KB

In [19]:
df['Founded'].fillna('unknown',inplace=True)
df['Founders'].fillna('unknown',inplace=True)
df['Investor'].fillna('unknown',inplace=True)

In [20]:
df.head(5)

,Company/Brand,Stage,Amount($),HeadQuarter,What_it_does,Sector,Founded,Founders,Investor
0,TheCollegeFever,Seed,250000.0,Bangalore,"TheCollegeFever is a hub for fun, fiesta and f...",Media & Entertainment,unknown,unknown,unknown
1,Happy Cow Dairy,Seed,1000000.0,Mumbai,A startup which aggregates milk from dairy far...,Agriculture,unknown,unknown,unknown
2,MyLoanCare,Series A,1000000.0,Gurgaon,Leading Online Loans Marketplace in India,Finance,unknown,unknown,unknown
3,PayMe India,Angel,2000000.0,Noida,PayMe India is an innovative FinTech organizat...,Finance,unknown,unknown,unknown
4,Eunimart,Seed,1000000.0,Hyderabad,Eunimart is a one stop solution for merchants ...,E-commerce,unknown,unknown,unknown

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2848 entries, 0 to 1179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  2848 non-null   object
 1   Stage          2848 non-null   object
 2   Amount($)      2848 non-null   float64
 3   HeadQuarter    2848 non-null   object
 4   What_it_does   2848 non-null   object
 5   Sector         2848 non-null   object
 6   Founded        2848 non-null   object
 7   Founders       2848 non-null   object
 8   Investor       2848 non-null   object
dtypes: float64(1), object(8)
memory usage: 222.5+ KB

In [22]:
df.shape

(2848, 9)

In [23]:
df.describe( include= 'all')

,Company/Brand,Stage,Amount($),HeadQuarter,What_it_does,Sector,Founded,Founders,Investor
count,2848,2848,2.848000e+03,2848,2848,2848,2848,2848,2848
unique,2213,15,NaN,124,2688,25,35,1982,1778
top,BharatPe,Seed,NaN,Bangalore,Provides online learning classes,Technology,unknown,unknown,unknown
freq,10,689,NaN,978,5,554,524,536,562
mean,NaN,NaN,9.837547e+07,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,3.102321e+09,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,7.500000e+03,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,1.000000e+06,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,3.000000e+06,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,7.225000e+06,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,1.500000e+11,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
df.isnull().sum()

Company/Brand    0
Stage            0
Amount($)        0
HeadQuarter      0
What_it_does     0
Sector           0
Founded          0
Founders         0
Investor         0
dtype: int64

In [25]:
df.duplicated().sum()

3

In [26]:
df.loc[df.duplicated()]

,Company/Brand,Stage,Amount($),HeadQuarter,What_it_does,Sector,Founded,Founders,Investor
145,Krimanshi,Seed,600000.0,Jodhpur,Krimanshi aims to increase rural income by imp...,Technology,2015.0,Nikhil Bohra,"Rajasthan Venture Capital Fund, AIM Smart City"
205,Nykaa,Unknown Stage,3000000.0,Mumbai,Nykaa is an online marketplace for different b...,Manufacturing,2012.0,Falguni Nayar,"Alia Bhatt, Katrina Kaif"
362,Byju’s,Unknown Stage,500000000.0,Bangalore,An Indian educational technology and online tu...,Education,2011.0,Byju Raveendran,"Owl Ventures, Tiger Global Management"

In [27]:
df.query('`Company/Brand`=="Krimanshi"')

,Company/Brand,Stage,Amount($),HeadQuarter,What_it_does,Sector,Founded,Founders,Investor
129,Krimanshi,Seed,600000.0,Jodhpur,Krimanshi aims to increase rural income by imp...,Technology,2015.0,Nikhil Bohra,"Rajasthan Venture Capital Fund, AIM Smart City"
145,Krimanshi,Seed,600000.0,Jodhpur,Krimanshi aims to increase rural income by imp...,Technology,2015.0,Nikhil Bohra,"Rajasthan Venture Capital Fund, AIM Smart City"
941,Krimanshi,Unknown Stage,20000.0,Jodhpur,Sustainable system to feed animals by valorizi...,Agriculture,2016.0,Nikhil Bohra,Arunachal Pradesh Social Entrepreneurship Meet

In [28]:
df.query('`Company/Brand`=="Nykaa"')

,Company/Brand,Stage,Amount($),HeadQuarter,What_it_does,Sector,Founded,Founders,Investor
511,Nykaa,Equity,1000000.0,Mumbai,Nykaa.com is a premier online beauty and welln...,Lifestyle,unknown,unknown,unknown
120,Nykaa,Unknown Stage,3000000.0,Mumbai,Nykaa is an online marketplace for different b...,Manufacturing,2012.0,Falguni Nayar,"Alia Bhatt, Katrina Kaif"
205,Nykaa,Unknown Stage,3000000.0,Mumbai,Nykaa is an online marketplace for different b...,Manufacturing,2012.0,Falguni Nayar,"Alia Bhatt, Katrina Kaif"
213,Nykaa,Unknown Stage,3000000.0,Mumbai,Nykaa is an online marketplace for different b...,E-commerce,2012.0,Falguni Nayar,"Katrina Kaif, Steadview Capital"
340,Nykaa,Unknown Stage,24700000.0,Mumbai,Cosmetics & beauty products online,Lifestyle,2012.0,Falguni Nayar,Steadview Capital
712,Nykaa,Unknown Stage,8800000.0,Mumbai,Deals in cosmetic and wellness products,E-commerce,2012.0,Falguni Nayar,Steadview capital
813,Nykaa,Unknown Stage,13137000.0,Mumbai,Deals in cosmetic and wellness products,E-commerce,2012.0,Falguni Nayar,Steadview capital

In [29]:
df=df.loc[~df.duplicated(subset=['Sector','Company/Brand','Stage','Amount($)','HeadQuarter','What_it_does','Founded','Founders','Investor'])].reset_index(drop=True).copy()

In [30]:
#df = df.drop_duplicates(subset=['Sector', 'Stage'])

In [31]:
df.duplicated().sum()

0

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2845 entries, 0 to 2844
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  2845 non-null   object
 1   Stage          2845 non-null   object
 2   Amount($)      2845 non-null   float64
 3   HeadQuarter    2845 non-null   object
 4   What_it_does   2845 non-null   object
 5   Sector         2845 non-null   object
 6   Founded        2845 non-null   object
 7   Founders       2845 non-null   object
 8   Investor       2845 non-null   object
dtypes: float64(1), object(8)
memory usage: 200.2+ KB